app/views/blog_posts/index.html.erb

SELECT "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."blog_post_id" = ?  [["blog_post_id", 1]]
---
	<div class="comments">
	<% @comments = BlogComment.where(:blog_post_id => blog_post.id) %>