app/controllers/arts_controller.rb

  def index
    @arts = Art.all
---
SELECT "arts".* FROM "arts"

  def create
    @art = Art.new(art_params)

    respond_to do |format|
      if @art.save
---
INSERT INTO "arts" ("name", "year", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "blargh"], ["year", 2987], ["description", "34343"], ["created_at", "2015-11-06 19:25:42.634084"], ["updated_at", "2015-11-06 19:25:42.634084"]]

  def destroy
    @art.destroy
---
DELETE FROM "arts" WHERE "arts"."id" = ?  [["id", 1]]

    def set_art
      @art = Art.find(params[:id])
---
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT 1  [["id", 1]]