app/controllers/blog_posts_controller.rb

SELECT "blog_posts".* FROM "blog_posts"  ORDER BY created_at DESC
---
  def index
    @blog_posts = BlogPost.all.order("created_at DESC")

INSERT INTO "blog_posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test Post 1"], ["body", "Hi, this is the first blog post"], ["created_at", "2015-11-10 03:04:24.904043"], ["updated_at", "2015-11-10 03:04:24.904043"]]
---
  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save

UPDATE "blog_posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["title", "Welcome!"], ["body", "Welcome to Ghost Notes, the site to view and buy the artwork of Sevvy Graves"], ["updated_at", "2015-11-13 20:30:33.608378"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)

SELECT  "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_blog_post
      @blog_post = BlogPost.find(params[:id])