app/controllers/blog_comments_controller.rb

SELECT "blog_comments".* FROM "blog_comments"
---
  def index
    @blog_comments = BlogComment.all

INSERT INTO "blog_comments" ("name", "body", "user", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Love this"], ["body", "Its super cool"], ["user", "Uberfan#1"], ["blog_post_id", 1], ["created_at", "2015-11-11 18:55:25.962041"], ["updated_at", "2015-11-11 18:55:25.962041"]]
---
  def create
    @blog_comment = BlogComment.new(blog_comment_params)

    respond_to do |format|
      if @blog_comment.save

SELECT  "blog_comments".* FROM "blog_comments" WHERE "blog_comments"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_blog_comment
      @blog_comment = BlogComment.find(params[:id])